Repository: Dzheremi2/Lexi
Catalog: po/*.po
Languages: de, hu

source: Lexicons
de: Lexika
hu: Lexikonok

source: Toggle sidebar
de: Seitenleiste umschalten
hu: Oldalsáv

source: Find Lexicon
de: Lexika finden
hu: Lexikon keresése

source: Add Lexicon
de: Lexikon hinzufügen
hu: Lexikon hozzáadása

source: App menu
de: App-Menü
hu: Menü megnyitása

source: Search…
de: Suchen…
hu: Keresés…

source: Sort by…
de: Sortieren nach…
hu: Rendezés…

source: Filter words by types
hu: Szavak szűrése típus alapján

source: Select words
de: Wörter auswählen
hu: Szavak kiválasztása

source: Delete selected words
de: Ausgewählte Wörter entfernen
hu: Kiválasztott szavak törlése

source: Find a word
de: Ein Wort finden
hu: Szó keresése

source: Query syntax: Word-based: Just word or its translation E.g. “Mom“, “Dad“ Tag-based: Query starts with “#”, contains tag name FULLY and doesn't contain word-based query E.g. “#basic#family”, “#basic #suffixes” BUT NOT: “#family mom” or “#famil”
hu: Keresés formája: Szó alapú: CSak egy szó, vagy fordítása Pl.: „Anya“, és „Apa“ Címke alapú: A keresés „#”-tel kezdődik, tartalmaz egy TELJES címkét, és nem tartalmaz szó alapú keresést Pl.: „#alap #család”, és „#alap #toldalékok” DE EZ NEM: „#család anya”, vagy „#csalá”

source: Add word
de: Wort hinzufügen
hu: Szó hozzáadása

source: Word
de: Wort
hu: Szó

source: Pronunciation
de: Aussprache
hu: Kiejtés

source: Translations
de: Übersetzungen
hu: Fordítások

source: Add translation
de: Übersetzung hinzufügen
hu: Fordítás hozzáadása

source: Word Type
de: Worttyp
hu: Szófaj

source: Assign word type
hu: Szófaj hozzárendelése

source: Examples
de: Beispiele
hu: Példák

source: Add example
de: Beispiel hinzufügen
hu: Példa hozzáadása

source: References
de: Referenzen
hu: Hivatkozások

source: Add reference
hu: Hivatkozás hozzáadása

source: Refer a Word
de: Verweise ein Wort
hu: Szó hivatkozása

source: Assign Word Type
hu: Szófaj hozzárendelése

source: Filter by Word Type
de: Filter nach Worttyp
hu: Szűrés szófaj alapján

source: Reset All
hu: Mind visszaállítása

source: No Lexicons found yet
de: Noch keine Lexika gefunden
hu: Még nincsenek lexikonok

source: No Lexicons found
de: Keine Lexika gefunden
hu: Nincsenek lexikonok

source: No Lexicons found for this search request
de: Keine Lexika für diese Suchanfrage gefunden
hu: Nincsenek lexikonok ehhez a kereséshez

source: No Words found yet
de: Noch keine Worte gefunden
hu: Még nincsenek szavak

source: Add Word
de: Wort hinzufügen
hu: Szó hozzáadása

source: No Words found
de: Keine Worte gefunden
hu: Nincsenek szavak

source: No Words found for this search request
de: Keine Worte für diese Suchanfrage gefunden
hu: Nincsenek szavak ehhez a kereséshez

source: No Lexicon selected
de: Keine Lexika ausgewählt
hu: Nincs lexikon kiválasztva

source: Please select a Lexicon to view its words
de: Bitte wähle ein Lexikon um seine Wörter anzuzeigen
hu: Válassz ki egy lexikont a szavainak megtekintéséhez

source: Add new Lexicon
hu: Lexikon hozzáadása

source: Name
hu: Név

source: Cancel
de: Abbrechen
hu: Mégsem

source: Add
hu: Hozzáadás

source: General
de: Allgemein
hu: Általános

source: Quit
de: Schließen
hu: Kilépés

source: Search words
de: Wörter suchen
hu: Szavak keresése

source: Reload words list
hu: Szólista újratöltése

source: Show preferences
de: Zeige Präferenzen
hu: Beállítások megnyitása

source: Keybindings
de: Tastenbelegung
hu: Gyorsbillentyűk megnyitása

source: Editing
de: Bearbeitung
hu: Szerkesztés

source: Add new word
de: Neues Wort hinzufügen
hu: Szó hozzáadása

source: Preferences
de: Präferenzen
hu: Beállítások

source: About
de: Über
hu: A Lexi névjegye

source: Ascending
de: Aufsteigend
hu: Növekvő

source: Descending
de: Absteigend
hu: Csökkenő

source: First Translation
de: Erste Übersetzung
hu: Első fordítás

source: Translation
de: Übersetzung
hu: Fordítás

source: Example
de: Beispiel
hu: Példa

source: Rename this Lexicon
hu: Lexikon átnevezése

source: Rename
de: Umbenennen
hu: Átnevezés

source: Delete this Lexicon?
de: Dieses Lexikon löschen?
hu: Törlöd ezt a Lexikont?

source: Delete
de: Löschen
hu: Törlés

source: Save changes on app exit
hu: Változtatások mentése kilépéskor

source: Save changes to the files only after the app exit to reduce the number of disk accesses May cause data loss
hu: A fájlok módosításait csak az alkalmazás bezárásakor mentse, ezzel csökkentve a lemezírások számát. Adatvesztéshez vezethet

source: Debug
hu: Hibakeresés

source: Use Debug logging profile
hu: Hibakeresési naplózási profil használata

source: Database
hu: Adatbázis

source: Backup
hu: Biztonsági másolat

source: Export Database
hu: Adatbázis expotrálása

source: Import Database
hu: Adatbázis importálása

source: Export
hu: Exportálás

source: Export to Memorado
hu: Exportálás a Memoradoba

source: Export Lexi database as Memorado compatible database
hu: Lexi adatbázis expotrálása a Memoradoval kompatibilis formátumban

source: Word Types
hu: Szófajok

source: Write new word type name here…
hu: Ide írd az új szófaj nevét…

source: Import Database?
hu: Importálod az adatbázist?

source: Importing database will ERASE the existing one!
hu: Az adatbázis importálása TÖRÖLNI fogja a meglévőt!

source: Import
hu: Importálás

source: Add new tag
hu: Címke hozzáadása

source: Selection check button
de: Auswahl Kontrollkästchen
hu: Kiválaszás jelölőgomb

source: Add Tag
hu: Címke hozzáadása

source: Type a new tag WITHOUT hashtag prefix and spaces. Existed tag also would be rejected
hu: Írjon be egy új címkét a „#” előtag és szóközök NÉLKÜL. A már létező címkék is elutasításra kerülnek

source: Tag…
hu: Címke…

source: Build your own dictionary
de: Erstelle dein eigenes Lexikon
hu: Állítsd össze a saját szótáradat

source: Lexi is a self-driven dictionary app for those who want to make their language learning (or creating) structured and easy
de: Lexi ist eine selbstverwaltete Lexikon-App für diejenigen, die das Lernen (oder Kreieren) von Sprachen strukturiert und einfach gestalten wollen
hu: Lexi egy önálló szótáralkalmazás azok számára, akik strukturálttá és egyszerűvé szeretnék tenni a nyelvtanulást (vagy nyelvteremtést)

source: You can give words:
de: Du kannst Wörter nennen:
hu: Egy szóhoz ezeket adhatod meg:

source: Word itself
de: Wort selbst
hu: A szót magát

source: Multiple translations
de: Mehrere Übersetzungen
hu: Több fordítást

source: Word types e.g. Noun, Verb, Adjective e.t.c
de: Wordtypen (bspw. Nomen, Verb, Adjektiv usw.)
hu: A szófajt, pl.: ige, főnév, melléknév, stb.

source: Multiple examples
de: Mehrere Beispiele
hu: Használati példákat

source: References to other words
de: Referenzen zu anderen Worten
hu: Hivatkozásokat más szavakhoz

source: Main window
de: Hauptfenster
hu: Főablak

source: Word type filter dialog
de: Worttyp Filterdialog
hu: Szófaj szűrési ablak

source: Main window on smaller display
de: Hauptfenster auf kleinerem Bildschirm
hu: Főablak kisebb kijelzőn

source: dict;dictionary;word;words;lexi;lexicon;lexicons;
de: dict;dictionary;word;words;lexi;lexicon;lexicons;Lexi;Lexikon;Wort;Wörter;Wörterbuch;Vokabular;
hu: dict;dictionary;word;words;lexi;lexicon;lexicons;lexikonok;szótár;szó;szófaj;szavak;

source: Noun
de: Nomen
hu: Főnév

source: Verb
hu: Ige

source: Adjective
de: Adjektiv
hu: Melléknév

source: Adverb
hu: Határozószó

source: Pronoun
de: Pronomen
hu: Névmás

source: Preposition
de: Präposition
hu: Elöljárószó

source: Conjunction
de: Konjunktion
hu: Kötőszó

source: Interjection
de: Ausrufe
hu: Indulatszó

source: Article
de: Artikel
hu: Névelő

source: Idiom
de: Sprichwort
hu: Közmondás

source: Clause
de: Satz
hu: Tagmondat

source: Prefix
de: Präfix
hu: Előtag

source: Suffix
hu: Utótag

source: translator-credits
de: Tjorben Nawroth
hu: Benedek Dévényi <rdbende@proton.me>

source: Inspiration
hu: Inspiráció

source: Advisers
hu: Tanácsadók

source: Sync lyrics of your loved songs
de: Synchronisiere die Texte deiner Lieblingslieder
hu: Szinkronizáld kedvenc dalaid szövegét

source: You have already referenced all words
de: Du hast bereits alle Worte referenziert
hu: Már minden szót hivatkoztál

source: No word types available
hu: Nincsenek elérhető szófajok

source: Configure
hu: Beállítás

source: No word types created yet
hu: Nem hoztál még létre szófajokat

source: Add a new word type to get started
hu: Kezdésnek adj hozzá egy szófajt

source: Delete this reference
de: Lösche diese Referenz
hu: Hivatkozás törlése

source: No translation yet
de: Bisher noch keine Übersetzung
hu: Még nincsen fordítás

source: Click LMB to search words with this tag Click RMB to remove this tag
hu: Balklikk erre a címkére való kereséshez Jobbklikk a címke eltávolításához

source: Backup exported successfully: {path}
hu: Biztonsági másolat sikeresen exportálva: {path}

source: Open
hu: Megnyitás

source: Database imported successfully
hu: Adatbázis sikeresen importálva

source: Incorrect Archive!
hu: Érvénytelen archívum!

source: Why?
hu: Miért?

source: This archive seems to be incorrect, since it wasn't passed proof of content challenge: no config.yaml file and/or lexicons folder inside
hu: Ez az archívum helytelennek tűnik, mivel nem felelt meg a tartalom ellenőrzésnek: nincs config.yaml fájl és/vagy lexicons mappa benne

source: Close
hu: Bezárás

source: Database Version Mismatch!
hu: Az adatbázis verziója nem megfelelő!

source: The database version in the archive does not match the current version of Lexi. Please, restart Lexi after importing this database.
hu: Az archívumban található adatbázis verziója nem egyezik a Lexi jelenlegi verziójával. Kérjük, egyből indítsd újra a Lexit az adatbázis importálása után.

source: Exit Lexi
hu: Kilépés

source: Memorado database exported successfully: {path}
hu: Memorado adatbázis sikeresen exportálva: {path}

source: Save
de: Speichern

source: Show filter dialog
de: Zeige Filterdialog

source: Automatically save word on change
de: Wort automatisch bei Änderung speichern

source: Word autosave is enabled
de: Automatisches Speichern von Wörtern ist aktiviert

source: Word saved
de: Wort gespeichert
